#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.port61-hc.aws_route53_health_check.this: Refreshing state... [id=1d2eb63b-01c1-4165-9e54-4f1491291f41]
module.port61-hc.aws_sns_topic.this: Refreshing state... [id=arn:aws:sns:us-east-1:009727205366:port61-prod-r53-healthcheck]
module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:009727205366:certificate/8ce6a6a4-d99c-448c-b2df-8934053f664d]
module.port80-hc.aws_route53_health_check.this: Refreshing state... [id=f2618e0c-bf6d-4e3c-bdaf-d5056dd193b4]
module.port443-hc.aws_route53_health_check.this: Refreshing state... [id=60f222b3-bb5a-4068-b289-05b088f6a902]
module.port80-hc.aws_sns_topic.this: Refreshing state... [id=arn:aws:sns:us-east-1:009727205366:port80-prod-r53-healthcheck]
module.port443-hc.aws_sns_topic.this: Refreshing state... [id=arn:aws:sns:us-east-1:009727205366:port443-prod-r53-healthcheck]
module.port61-hc.aws_sns_topic_subscription.this[0]: Refreshing state... [id=arn:aws:sns:us-east-1:009727205366:port61-prod-r53-healthcheck:e9e57bf8-a90a-4b57-b141-e8baa882dce4]
module.port61-hc.aws_cloudwatch_metric_alarm.this: Refreshing state... [id=port61-r53-healthcheck-failed-prod]
module.port80-hc.aws_sns_topic_subscription.this[0]: Refreshing state... [id=arn:aws:sns:us-east-1:009727205366:port80-prod-r53-healthcheck:857b34eb-b1d5-4822-b4f8-a7ba6cddd42d]
module.port80-hc.aws_cloudwatch_metric_alarm.this: Refreshing state... [id=port80-r53-healthcheck-failed-prod]
module.port443-hc.aws_cloudwatch_metric_alarm.this: Refreshing state... [id=port443-r53-healthcheck-failed-prod]
module.port443-hc.aws_sns_topic_subscription.this[0]: Refreshing state... [id=arn:aws:sns:us-east-1:009727205366:port443-prod-r53-healthcheck:146e10d8-ef13-4e02-8c14-6b4d35f32417]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__7e17ed3c254a4598e2141844c108f21c.capnduck.com._CNAME]
module.acm.aws_route53_record.validation[1]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__c39759b1b4ce68a0a58295c7c4040ee4.www.capnduck.com._CNAME]
aws_ecr_repository.this: Refreshing state... [id=capnduck]
module.zones.aws_route53_zone.this["jelliott.io"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-west-2:009727205366:cluster/default]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-09289eb9291b2949c]
aws_dynamodb_table.tfstate_lock: Refreshing state... [id=terraform-tfstate-lock]
aws_kms_key.tfstate: Refreshing state... [id=2345718b-73b8-4880-bb03-238c0ab24f02]
aws_s3_bucket.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
aws_ecr_lifecycle_policy.this: Refreshing state... [id=capnduck]
module.jelliott_records.aws_route53_record.this[" NS"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R_jelliott.io_NS]
module.jelliott_records.aws_route53_record.this["jenkins A"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R_jenkins.jelliott.io_A]
module.capnduck_records.aws_route53_record.this["webmail CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_webmail.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this[" TXT"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_TXT]
module.capnduck_records.aws_route53_record.this["groups CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_groups.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this[" CAA"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_CAA]
module.capnduck_records.aws_route53_record.this[" MX"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_MX]
module.capnduck_records.aws_route53_record.this["_dmarc TXT"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__dmarc.capnduck.com_TXT]
module.capnduck_records.aws_route53_record.this["calendar CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_calendar.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["subsonic CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_subsonic.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["sites CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_sites.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["mail CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_mail.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["drive CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_drive.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this[" NS"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_NS]
module.ecs.aws_ecs_cluster_capacity_providers.this: Refreshing state... [id=default]
aws_kms_alias.tfstate: Refreshing state... [id=alias/terraform-state]
module.http_https_eveywhere.aws_security_group.this: Refreshing state... [id=sg-0388b4dac711c08af]
module.all_from_home.aws_security_group.this: Refreshing state... [id=sg-0d859e28c6fb1bd67]
aws_db_subnet_group.private: Refreshing state... [id=private]
aws_db_subnet_group.public: Refreshing state... [id=public]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f6f3efb89a553c06]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b5922e4433793379]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c035011e361ea452]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00dd8e548892facba]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-0253184dc60aaf031]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06f85801b091e2759]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-04a38528da1dcb2ed]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-06947ef14298c9e67]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a284c52e2f9146f9]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a5bc5ec073940dca]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b94d7faf68936e3c]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0d4d4b200aefd41b0]
module.vpc.aws_route_table.private[3]: Refreshing state... [id=rtb-087cf48ecff5bea3d]
module.vpc.aws_route_table.private[4]: Refreshing state... [id=rtb-0b177960d81a2f1b7]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-067bf7d1691134086]
module.vpc.aws_route_table.private[5]: Refreshing state... [id=rtb-027c5b9b1eb67dea9]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09518df5801cf8b31]
module.http_https_eveywhere.aws_security_group_rule.egress: Refreshing state... [id=sgrule-707140775]
module.http_https_eveywhere.aws_security_group_rule.tcp[0]: Refreshing state... [id=sgrule-2712767898]
module.http_https_eveywhere.aws_security_group_rule.tcp[1]: Refreshing state... [id=sgrule-3196345934]
module.all_from_home.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3062342158]
module.all_from_home.aws_security_group_rule.tcp[0]: Refreshing state... [id=sgrule-4003057379]
module.all_from_home.aws_security_group_rule.tcp[7]: Refreshing state... [id=sgrule-3784432811]
module.all_from_home.aws_security_group_rule.tcp[6]: Refreshing state... [id=sgrule-982632931]
module.all_from_home.aws_security_group_rule.tcp[1]: Refreshing state... [id=sgrule-3267160306]
module.all_from_home.aws_security_group_rule.tcp[2]: Refreshing state... [id=sgrule-1802098388]
module.all_from_home.aws_security_group_rule.tcp[5]: Refreshing state... [id=sgrule-2583252385]
module.all_from_home.aws_security_group_rule.tcp[4]: Refreshing state... [id=sgrule-2830436369]
module.all_from_home.aws_security_group_rule.tcp[3]: Refreshing state... [id=sgrule-2328370322]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00dd8e548892facba1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a770f077e552adef]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0908e20c0a154e529]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08aeb7e5177ca14d3]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-0872b6bcb7685165d]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-073a8a256a9e206ac]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-0a6ea86a864cfcd34]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b85474b5faae36af]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bd896340bfa89863]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09d42e8fc1a0347af]
aws_s3_bucket_acl.tfstate: Refreshing state... [id=capnduck-terraform-tfstate,private]
aws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
aws_s3_bucket_versioning.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.port32400-hc.aws_cloudwatch_metric_alarm.this will be created
  + resource "aws_cloudwatch_metric_alarm" "this" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors whether the endpoint ( tcp://subsonic.capnduck.com:32400 ) is UP or DOWN"
      + alarm_name                            = "port32400-r53-healthcheck-failed-prod"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = (known after apply)
      + metric_name                           = "HealthCheckStatus"
      + namespace                             = "AWS/Route53"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Minimum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
      + unit                                  = "None"
    }

  # module.port32400-hc.aws_route53_health_check.this will be created
  + resource "aws_route53_health_check" "this" {
      + arn               = (known after apply)
      + disabled          = false
      + enable_sni        = (known after apply)
      + failure_threshold = 3
      + fqdn              = "subsonic.capnduck.com"
      + id                = (known after apply)
      + measure_latency   = true
      + port              = 32400
      + request_interval  = 30
      + tags              = {
          + "Name"   = "port32400-prod"
          + "module" = "aws_route53_healthcheck"
        }
      + tags_all          = {
          + "Name"   = "port32400-prod"
          + "module" = "aws_route53_healthcheck"
        }
      + type              = "TCP"
    }

  # module.port32400-hc.aws_sns_topic.this will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + delivery_policy             = jsonencode(
            {
              + http = {
                  + defaultHealthyRetryPolicy    = {
                      + backoffFunction    = "linear"
                      + maxDelayTarget     = 20
                      + minDelayTarget     = 20
                      + numMaxDelayRetries = 0
                      + numMinDelayRetries = 0
                      + numNoDelayRetries  = 0
                      + numRetries         = 3
                    }
                  + defaultThrottlePolicy        = {
                      + maxReceivesPerSecond = 1
                    }
                  + disableSubscriptionOverrides = false
                }
            }
        )
      + display_name                = "Healthcheck for port32400-prod"
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "port32400-prod-r53-healthcheck"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # module.port32400-hc.aws_sns_topic_subscription.this[0] will be created
  + resource "aws_sns_topic_subscription" "this" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "aws-prod@capnduck.com"
      + endpoint_auto_confirms          = true
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @CapnDucks, Action: `pull_request`*